src/main/resources/sample_requests/get_country.xml

<!-- This file is not a part of the project itself. It's just a sample SOAP request to send -->
<!-- curl -u foo:bar [double_hyphen]header "content-type: text/xml" -d @get_country.xml http://localhost:8080/ws -->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:ns1="http://hello/SOAP/countries">
   <soapenv:Header/>
   <soapenv:Body>
      <ns1:getCountryRequest>
         <ns1:name>Poland</ns1:name>
      </ns1:getCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>
